twitter/app/controllers/users_controller.rb

  def new
    @user = User.create
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-06-25 05:24:03.052862"], ["updated_at", "2014-06-25 05:24:03.052862"]]

  def create
    #@user.save
     auth = request.env["omniauth.auth"]
     @user = User.create_with_omniauth(auth)
---
INSERT INTO "users" ("access_secret", "access_token", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)